[
  {
    "title": "DSLRoot, Proxies, and the Threat of ‘Legal Botnets’",
    "url": "https://krebsonsecurity.com/2025/08/dslroot-proxies-and-the-threat-of-legal-botnets/",
    "source": "Krebs on Security",
    "category": "general",
    "published_date": "2025-08-26T14:05:12",
    "summary": "The cybersecurity community on Reddit responded in disbelief this month when a self-described Air National Guard member with top secret security clearance began questioning the arrangement they'd made with company called DSLRoot, which was paying $250 a month to plug a pair of laptops into the Redditor's high-speed Internet connection in the United States. This post examines the history and provenance of DSLRoot, one of the oldest \"residential proxy\" networks with origins in Russia and Eastern Europe.",
    "content": "The cybersecurity community on Reddit responded in disbelief this month when a self-described Air National Guard member with top secret security clearance began questioning the arrangement they&#8217;d made with company called DSLRoot, which was paying $250 a month to plug a pair of laptops into the Redditor&#8217;s high-speed Internet connection in the United States. This post examines the history and provenance of DSLRoot, one of the oldest &#8220;residential proxy&#8221; networks with origins in Russia and Eastern Europe. The query about DSLRoot came from a Reddit user &#8220;Sacapoopie,&#8221; who did not respond to questions. This user has since deleted the original question from their post, although some of their replies to other Reddit cybersecurity enthusiasts remain in the thread. The original post was indexed here by archive.is, and it began with a question: &#8220;I have been getting paid 250$ a month by a residential IP network provider named DSL root to host devices in my home,&#8221; Sacapoopie wrote. &#8220;They are on a separate network than what we use for personal use. They have dedicated DSL connections (one per host) to the ISP that provides the DSL coverage. My family used Starlink. Is this stupid for me to do? They just sit there and I get paid for it. The company pays the internet bill too.&#8221; Many Redditors said they assumed Sacapoopie&#8217;s post was a joke, and that nobody with a cybersecurity background and top-secret (TS/SCI) clearance would agree to let some shady residential proxy company introduce hardware into their network. Other readers pointed to a slew of posts from Sacapoopie in the Cybersecurity subreddit over the past two years about their work on cybersecurity for the Air National Guard. When pressed for more details by fellow Redditors, Sacapoopie described the equipment supplied by DSLRoot as &#8220;just two laptops hardwired into a modem, which then goes to a dsl port in the wall.&#8221; &#8220;When I open the computer, it looks like [they] have some sort of custom application that runs and spawns several cmd prompts,&#8221; the Redditor explained. &#8220;All I can infer from what I see in them is they are making connections.&#8221; When asked how they became acquainted with DSLRoot, Sacapoopie told another user they discovered the company and reached out after viewing an advertisement on a social media platform. &#8220;This was probably 5-6 years ago,&#8221; Sacapoopie wrote. &#8220;Since then I just communicate with a technician from that company and I help trouble shoot connectivity issues when they arise.&#8221; Reached for comment, DSLRoot said its brand has been unfairly maligned thanks to that Reddit discussion. The unsigned email said DSLRoot is fully transparent about its goals and operations, adding that it operates under full consent from its &#8220;regional agents,&#8221; the company&#8217;s term for U.S. residents like Sacapoopie. &#8220;As although we support honest journalism, we&#8217;re against of all kinds of &#8216;low rank/misleading Yellow Journalism&#8217; done for the sake of cheap hype,&#8221; DSLRoot wrote in reply. &#8220;It&#8217;s obvious to us that whoever is doing this, is either lacking a proper understanding of the subject or doing it intentionally to gain exposure by misleading those who lack proper understanding,&#8221; DSLRoot wrote in answer to questions about the company&#8217;s intentions. &#8220;We monitor our clients and prohibit any illegal activity associated with our residential proxies,&#8221; DSLRoot continued. &#8220;We honestly didn&#8217;t know that the guy who made the Reddit post was a military guy. Be it an African-American granny trying to pay her rent or a white kid trying to get through college, as long as they can provide an Internet line or host phones for us &#8212; we&#8217;re good.&#8221; WHAT IS DSLROOT? DSLRoot is sold as a residential proxy service on the forum BlackHatWorld under the name DSLRoot and GlobalSolutions. The company is based in the Bahamas and was formed in 2012. The service is advertised to people who are not in the United States but who want to seem like they are. DSLRoot pays people in the United States to run the company&#8217;s hardware and software &#8212; including 5G mobile devices &#8212; and in return it rents those IP addresses as dedicated proxies to customers anywhere in the world &#8212; priced at $190 per month for unrestricted access to all locations. The DSLRoot website. The GlobalSolutions account on BlackHatWorld lists a Telegram account and a WhatsApp number in Mexico. DSLRoot&#8217;s profile on the marketing agency digitalpoint.com from 2010 shows their previous username on the forum was &#8220;Incorptoday.&#8221; GlobalSolutions user accounts at bitcointalk[.]org and roclub[.]com include the email clickdesk@instantvirtualcreditcards[.]com. Passive DNS records from DomainTools.com show instantvirtualcreditcards[.]com shared a host back then &#8212; 208.85.1.164 &#8212; with just a handful of domains, including dslroot[.]com, regacard[.]com, 4groot[.]com, residential-ip[.]com, 4gemperor[.]com, ip-teleport[.]com, proxysource[.]net and proxyrental[.]net. Cyber intelligence firm Intel 471 finds GlobalSolutions registered on BlackHatWorld in 2016 using the email address prepaidsolutions@yahoo.com. This user shared that their birthday is March 7, 1984. Several negative reviews about DSLRoot on the forums noted that the service was operated by a BlackHatWorld user calling himself &#8220;USProxyKing.&#8221; Indeed, Intel 471 shows this user told fellow forum members in 2013 to contact him at the Skype username &#8220;dslroot.&#8221; USProxyKing on BlackHatWorld, soliciting installations of his adware via torrents and file-sharing sites. USProxyKing had a reputation for spamming the forums with ads for his residential proxy service, and he ran a &#8220;pay-per-install&#8221; program where he paid affiliates a small commission each time one of their websites resulted in the installation of his unspecified &#8220;adware&#8221; programs &#8212; presumably a program that turned host PCs into proxies. On the other end of the business, USProxyKing sold that pay-per-install access to others wishing to distribute questionable software &#8212; at $1 per installation. Private messages indexed by Intel 471 show USProxyKing also raised money from nearly 20 different BlackHatWorld members who were promised shareholder positions in a new business that would offer robocalling services capable of placing 2,000 calls per minute. Constella Intelligence, a platform that tracks data exposed in breaches, finds that same IP address GlobalSolutions used to register at BlackHatWorld was also used to create accounts at a handful of sites, including a GlobalSolutions user account at WebHostingTalk that supplied the email address incorptoday@gmail.com. Also registered to incorptoday@gmail.com are the domains dslbay[.]com, dslhub[.]net, localsim[.]com, rdslpro[.]com, virtualcards[.]biz/cc, and virtualvisa[.]cc. Recall that DSLRoot&#8217;s profile on digitalpoint.com was previously named Incorptoday. DomainTools says incorptoday@gmail.com is associated with almost two dozen domains going back to 2008, including incorptoday[.]com, a website that offers to incorporate businesses in several states, including Delaware, Florida and Nevada, for prices ranging from $450 to $550. As we can see in this archived copy of the site from 2013, IncorpToday also offered a premiere service for $750 that would allow the customer&#8217;s new company to have a retail checking account, with no questions asked. Global Solutions is able to provide access to the U.S. banking system by offering customers prepaid cards that can be loaded with a variety of virtual payment instruments that were popular in Russian-speaking countries at the time, including WebMoney. The cards are limited to $500 balances, but non-Westerners can use them to anonymously pay for goods and services at a variety of Western companies. Cardnow[.]ru, another domain registered to incorptoday@gmail.com, demonstrates this in action. A copy of Incorptoday&#8217;s website from 2013 offers non-US residents a service to incorporate a business in Florida, Delaware or Nevada, along with a no-questions-asked checking account, for $750. WHO IS ANDREI HOLAS? The oldest domain (2008) registered to incorptoday@gmail.com is andrei[.]me; another is called andreigolos[.]com. DomainTools says these and other domains registered to that email address include the registrant name Andrei Holas, from Huntsville, Ala. Public records indicate Andrei Holas has lived with his brother &#8212; Aliaksandr Holas &#8212; at two different addresses in Alabama. Those records state that Andrei Holas&#8217; birthday is in March 1984, and that his brother is slightly younger. The younger brother did not respond to a request for comment. Andrei Holas maintained an account on the Russian social network Vkontakte under the email address ryzhik777@gmail.com, an address that shows up in numerous records hacked and leaked from Russian government entities over the past few years. Those records indicate Andrei Holas and his brother are from Belarus and have maintained an address in Moscow for some time (that address is roughly three blocks away from the main headquarters of the Russian FSB, the successor intelligence agency to the KGB). Hacked Russian banking records show Andrei Holas&#8217; birthday is March 7, 1984 &#8212; the same birth date listed by GlobalSolutions on BlackHatWorld. A 2010 post by ryzhik777@gmail.com at the Russian-language forum Ulitka explains that the poster was having trouble getting his B1/B2 visa to visit his brother in the United States, even though he&#8217;d previously been approved for two separate guest visas and a student visa. It remains unclear if one, both, or neither of the Holas brothers still lives in the United States. Andrei explained in 2010 that his brother was an American citizen. LEGAL BOTNETS We can all wag our fingers at military personnel who should undoubtedly know better than to install Internet hardware from strangers, but in truth there is an endless supply of U.S. residents who will resell their Internet connection if it means they can make a few bucks out of it. And these days, there are plenty of residential proxy providers who will make it worth your while. Traditionally, residential proxy networks have been constructed using malicious software that quietly turns infected systems into traffic relays that are then sold in shadowy online forums. Most often, this malware gets bundled with popular cracked software and video files that are uploaded to file-sharing networks and that secretly turn the host device into a traffic relay. In fact, USPRoxyKing bragged that he routinely achieved thousands of installs per week via this method alone. These days, there a number of residential proxy networks that entice users to monetize their unused bandwidth (inviting you to violate the terms of service of your ISP in the process); others, like DSLRoot, act as a communal VPN, and by using the service you gain access to the connections of other proxies (users) by default, but you also agree to share your connection with others. Indeed, Intel 471&#8217;s archives show the GlobalSolutions and DSLRoot accounts routinely received private messages from forum users who were college students or young people trying to make ends meet. Those messages show that many of DSLRoot&#8217;s &#8220;regional agents&#8221; often sought commissions to refer friends interested in reselling their home Internet connections (DSLRoot would offer to cover the monthly cost of the agent&#8217;s home Internet connection). But in an era when North Korean hackers are relentlessly posing as Western IT workers by paying people to host laptop farms in the United States, letting strangers run laptops, mobile devices or any other hardware on your network seems like an awfully risky move regardless of your station in life. As several Redditors pointed out in Sacapoopie&#8217;s thread, an Arizona woman was sentenced in July 2025 to 102 months in prison for hosting a laptop farm that helped North Korean hackers secure jobs at more than 300 U.S. companies, including Fortune 500 firms. Lloyd Davies is the founder of Infrawatch, a London-based security startup that tracks residential proxy networks. Davies said he reverse engineered the software that powers DSLRoot&#8217;s proxy service, and found it phones home to the aforementioned domain proxysource[.]net, which sells a service that promises to &#8220;get your ads live in multiple cities without getting banned, flagged or ghosted&#8221; (presumably a reference to CraigsList ads). Davies said he found the DSLRoot installer had capabilities to remotely control residential networking equipment across multiple vendor brands. Image: Infrawatch.app. &#8220;The software employs vendor-specific exploits and hardcoded administrative credentials, suggesting DSLRoot pre-configures equipment before deployment,&#8221; Davies wrote in an analysis published today. He said the software performs WiFi network enumeration to identify nearby wireless networks, thereby &#8220;potentially expanding targeting capabilities beyond the primary internet connection.&#8221; It&#8217;s unclear exactly when the USProxyKing was usurped from his throne, but DSLRoot and its proxy offerings are not what they used to be. Davies said the entire DSLRoot network now has fewer than 300 nodes nationwide, mostly systems on DSL providers like CenturyLink and Frontier. On Aug. 17, GlobalSolutions posted to BlackHatWorld saying, &#8220;We&#8217;re restructuring our business model by downgrading to &#8216;DSL only&#8217; lines (no mobile or cable).&#8221; Asked via email about the changes, DSLRoot blamed the decline in his customers on the proliferation of residential proxy services. &#8220;These days it has become almost impossible to compete in this niche as everyone is selling residential proxies and many companies want you to install a piece of software on your phone or desktop so they can resell your residential IPs on a much larger scale,&#8221; DSLRoot explained. &#8220;So-called &#8216;legal botnets&#8217; as we see them.&#8221;",
    "keywords": [
      "exploit",
      "malware",
      "APT"
    ],
    "priority_score": 35,
    "article_id": "d0d122aff7a4"
  },
  {
    "title": "WhatsApp Issues Emergency Update for Zero-Click Exploit Targeting iOS and macOS Devices",
    "url": "https://thehackernews.com/2025/08/whatsapp-issues-emergency-update-for.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-30T04:36:00",
    "summary": "WhatsApp has addressed a security vulnerability in its messaging apps for Apple iOS and macOS that it said may have been exploited in the wild in conjunction with a recently disclosed Apple flaw in targeted zero-day attacks. The vulnerability, CVE-2025-55177 (CVSS score: 8.0), relates to a case of insufficient authorization of linked device synchronization messages. Internal researchers on the",
    "content": "WhatsApp has addressed a security vulnerability in its messaging apps for Apple iOS and macOS that it said may have been exploited in the wild in conjunction with a recently disclosed Apple flaw in targeted zero-day attacks. The vulnerability, CVE-2025-55177 (CVSS score: 8.0), relates to a case of insufficient authorization of linked device synchronization messages. Internal researchers on the",
    "keywords": [
      "zero-day",
      "vulnerability",
      "exploit"
    ],
    "priority_score": 35,
    "article_id": "100752db6785"
  },
  {
    "title": "FreePBX Servers Targeted by Zero-Day Flaw, Emergency Patch Now Available",
    "url": "https://thehackernews.com/2025/08/freepbx-servers-targeted-by-zero-day.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T09:44:00",
    "summary": "The Sangoma FreePBX Security Team has issued an advisory warning about an actively exploited FreePBX zero-day vulnerability that impacts systems with an administrator control panel (ACP) exposed to the public internet. FreePBX is an open-source private branch exchange (PBX) platform widely used by businesses, call centers, and service providers to manage voice communications. It's built on top",
    "content": "The Sangoma FreePBX Security Team has issued an advisory warning about an actively exploited FreePBX zero-day vulnerability that impacts systems with an administrator control panel (ACP) exposed to the public internet. FreePBX is an open-source private branch exchange (PBX) platform widely used by businesses, call centers, and service providers to manage voice communications. It's built on top",
    "keywords": [
      "zero-day",
      "vulnerability",
      "exploit"
    ],
    "priority_score": 35,
    "article_id": "66d2e38a46d2"
  },
  {
    "title": "Storm-0501 Exploits Entra ID to Exfiltrate and Delete Azure Data in Hybrid Cloud Attacks",
    "url": "https://thehackernews.com/2025/08/storm-0501-exploits-entra-id-to.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-27T19:04:00",
    "summary": "The financially motivated threat actor known as Storm-0501 has been observed refining its tactics to conduct data exfiltration and extortion attacks targeting cloud environments. \"Unlike traditional on-premises ransomware, where the threat actor typically deploys malware to encrypt critical files across endpoints within the compromised network and then negotiates for a decryption key,",
    "content": "The financially motivated threat actor known as Storm-0501 has been observed refining its tactics to conduct data exfiltration and extortion attacks targeting cloud environments. \"Unlike traditional on-premises ransomware, where the threat actor typically deploys malware to encrypt critical files across endpoints within the compromised network and then negotiates for a decryption key,",
    "keywords": [
      "ransomware",
      "exploit",
      "malware"
    ],
    "priority_score": 35,
    "article_id": "3adb136258be"
  },
  {
    "title": "Ransomware Group Exploits Hybrid Cloud Gaps, Gains Full Azure Control in Enterprise Attacks",
    "url": "https://www.securityweek.com/ransomware-group-exploits-hybrid-cloud-gaps-gains-full-azure-control-in-enterprise-attacks/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T12:10:40",
    "summary": "Storm-0501 has been leveraging cloud-native capabilities for data exfiltration and deletion, without deploying file-encrypting malware. The post Ransomware Group Exploits Hybrid Cloud Gaps, Gains Full Azure Control in Enterprise Attacks appeared first on SecurityWeek.",
    "content": "Storm-0501 has been leveraging cloud-native capabilities for data exfiltration and deletion, without deploying file-encrypting malware. The post Ransomware Group Exploits Hybrid Cloud Gaps, Gains Full Azure Control in Enterprise Attacks appeared first on SecurityWeek.",
    "keywords": [
      "ransomware",
      "exploit",
      "malware"
    ],
    "priority_score": 33,
    "article_id": "79453819510f"
  },
  {
    "title": "WhatsApp patches vulnerability exploited in zero-day attacks",
    "url": "https://www.bleepingcomputer.com/news/security/whatsapp-patches-vulnerability-exploited-in-zero-day-attacks/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-29T16:31:23",
    "summary": "WhatsApp has patched a security vulnerability in its iOS and macOS messaging clients that was exploited in targeted zero-day attacks. [...]",
    "content": "WhatsApp has patched a security vulnerability in its iOS and macOS messaging clients that was exploited in targeted zero-day attacks. [...]",
    "keywords": [
      "zero-day",
      "vulnerability",
      "exploit"
    ],
    "priority_score": 30,
    "article_id": "3b6d289da288"
  },
  {
    "title": "Salt Typhoon Exploits Flaws in Edge Network Devices to Breach 600 Organizations Worldwide",
    "url": "https://thehackernews.com/2025/08/salt-typhoon-exploits-cisco-ivanti-palo.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-28T14:04:00",
    "summary": "The China-linked advanced persistent threat (APT) actor known as Salt Typhoon has continued its attacks targeting networks across the world, including organizations in the telecommunications, government, transportation, lodging, and military infrastructure sectors. \"While these actors focus on large backbone routers of major telecommunications providers, as well as provider edge (PE) and",
    "content": "The China-linked advanced persistent threat (APT) actor known as Salt Typhoon has continued its attacks targeting networks across the world, including organizations in the telecommunications, government, transportation, lodging, and military infrastructure sectors. \"While these actors focus on large backbone routers of major telecommunications providers, as well as provider edge (PE) and",
    "keywords": [
      "exploit",
      "APT"
    ],
    "priority_score": 25,
    "article_id": "723aedcfa41f"
  },
  {
    "title": "Proof-of-Concept in 15 Minutes? AI Turbocharges Exploitation",
    "url": "https://www.darkreading.com/vulnerabilities-threats/proof-concept-15-minutes-ai-turbocharges-exploitation",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-29T13:01:00",
    "summary": "Generating exploits with AI and large language models shrinks the time to target software flaws, giving security teams scant time to patch. Can enterprises adapt?",
    "content": "Generating exploits with AI and large language models shrinks the time to target software flaws, giving security teams scant time to patch. Can enterprises adapt?",
    "keywords": [
      "exploit",
      "APT"
    ],
    "priority_score": 25,
    "article_id": "fe0e54154907"
  },
  {
    "title": "China Hijacks Captive Portals to Spy on Asian Diplomats",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/china-hijacks-captive-portals-spy-asian-diplomats",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T19:31:03",
    "summary": "The Mustang Panda APT is hijacking Google Chrome browsers when they attempt to connect to new networks and redirecting them to phishing sites.",
    "content": "The Mustang Panda APT is hijacking Google Chrome browsers when they attempt to connect to new networks and redirecting them to phishing sites.",
    "keywords": [
      "phishing",
      "APT"
    ],
    "priority_score": 25,
    "article_id": "40fc09cff80b"
  },
  {
    "title": "US Sanctions Russian National, Chinese Firm Aiding North Korean IT Workers",
    "url": "https://www.securityweek.com/us-sanctions-russian-national-chinese-firm-aiding-north-korean-it-workers/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T12:17:52",
    "summary": "US Treasury sanctions Russian and Chinese entities tied to North Korea’s use of fake IT workers, who exploited stolen identities, AI, and malware to funnel millions back to Pyongyang. The post US Sanctions Russian National, Chinese Firm Aiding North Korean IT Workers appeared first on SecurityWeek.",
    "content": "US Treasury sanctions Russian and Chinese entities tied to North Korea’s use of fake IT workers, who exploited stolen identities, AI, and malware to funnel millions back to Pyongyang. The post US Sanctions Russian National, Chinese Firm Aiding North Korean IT Workers appeared first on SecurityWeek.",
    "keywords": [
      "exploit",
      "malware"
    ],
    "priority_score": 23,
    "article_id": "ffd262362adc"
  },
  {
    "title": "China’s Salt Typhoon Hacked Critical Infrastructure Globally for Years",
    "url": "https://www.securityweek.com/chinas-salt-typhoon-hacked-critical-infrastructure-globally-for-years/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-28T13:56:14",
    "summary": "China-linked APT ‘Salt Typhoon’ exploited known router flaws to maintain persistent access across telecom, government, and military networks, giving Beijing’s intelligence services global surveillance reach. The post China’s Salt Typhoon Hacked Critical Infrastructure Globally for Years appeared first on SecurityWeek.",
    "content": "China-linked APT ‘Salt Typhoon’ exploited known router flaws to maintain persistent access across telecom, government, and military networks, giving Beijing’s intelligence services global surveillance reach. The post China’s Salt Typhoon Hacked Critical Infrastructure Globally for Years appeared first on SecurityWeek.",
    "keywords": [
      "exploit",
      "APT"
    ],
    "priority_score": 23,
    "article_id": "3711ce734bab"
  },
  {
    "title": "Malware devs abuse Anthropic’s Claude AI to build ransomware",
    "url": "https://www.bleepingcomputer.com/news/security/malware-devs-abuse-anthropics-claude-ai-to-build-ransomware/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T17:08:08",
    "summary": "Anthropic's Claude Code large language model has been abused by threat actors who used it in data extortion campaigns and to develop ransomware packages. [...]",
    "content": "Anthropic's Claude Code large language model has been abused by threat actors who used it in data extortion campaigns and to develop ransomware packages. [...]",
    "keywords": [
      "ransomware",
      "malware"
    ],
    "priority_score": 20,
    "article_id": "ee6fa01482d6"
  },
  {
    "title": "Researchers Warn of Sitecore Exploit Chain Linking Cache Poisoning and Remote Code Execution",
    "url": "https://thehackernews.com/2025/08/researchers-warn-of-sitecore-exploit.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T17:22:00",
    "summary": "Three new security vulnerabilities have been disclosed in the Sitecore Experience Platform that could be exploited to achieve information disclosure and remote code execution.&nbsp; The flaws, per watchTowr Labs, are listed below - CVE-2025-53693 - HTML cache poisoning through unsafe reflections CVE-2025-53691 - Remote code execution (RCE) through insecure deserialization CVE-2025-53694 -",
    "content": "Three new security vulnerabilities have been disclosed in the Sitecore Experience Platform that could be exploited to achieve information disclosure and remote code execution.&nbsp; The flaws, per watchTowr Labs, are listed below - CVE-2025-53693 - HTML cache poisoning through unsafe reflections CVE-2025-53691 - Remote code execution (RCE) through insecure deserialization CVE-2025-53694 -",
    "keywords": [
      "exploit"
    ],
    "priority_score": 15,
    "article_id": "04c00e15338e"
  },
  {
    "title": "Webinar: Learn How to Unite Dev, Sec, and Ops Teams With One Shared Playbook",
    "url": "https://thehackernews.com/2025/08/webinar-why-top-teams-are-prioritizing.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T15:42:00",
    "summary": "Picture this: Your team rolls out some new code, thinking everything's fine. But hidden in there is a tiny flaw that explodes into a huge problem once it hits the cloud. Next thing you know, hackers are in, and your company is dealing with a mess that costs millions. Scary, right? In 2025, the average data breach hits businesses with a whopping $4.44 million bill globally. And guess what? A big",
    "content": "Picture this: Your team rolls out some new code, thinking everything's fine. But hidden in there is a tiny flaw that explodes into a huge problem once it hits the cloud. Next thing you know, hackers are in, and your company is dealing with a mess that costs millions. Scary, right? In 2025, the average data breach hits businesses with a whopping $4.44 million bill globally. And guess what? A big",
    "keywords": [
      "data breach"
    ],
    "priority_score": 15,
    "article_id": "62a9d2110696"
  },
  {
    "title": "Amazon Disrupts APT29 Watering Hole Campaign Abusing Microsoft Device Code Authentication",
    "url": "https://thehackernews.com/2025/08/amazon-disrupts-apt29-watering-hole.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T13:22:00",
    "summary": "Amazon on Friday said it flagged and disrupted what it described as an opportunistic watering hole campaign orchestrated by the Russia-linked APT29 actors as part of their intelligence gathering efforts. The campaign used \"compromised websites to redirect visitors to malicious infrastructure designed to trick users into authorizing attacker-controlled devices through Microsoft's device code",
    "content": "Amazon on Friday said it flagged and disrupted what it described as an opportunistic watering hole campaign orchestrated by the Russia-linked APT29 actors as part of their intelligence gathering efforts. The campaign used \"compromised websites to redirect visitors to malicious infrastructure designed to trick users into authorizing attacker-controlled devices through Microsoft's device code",
    "keywords": [
      "APT"
    ],
    "priority_score": 15,
    "article_id": "b2209cac905f"
  },
  {
    "title": "Abandoned Sogou Zhuyin Update Server Hijacked, Weaponized in Taiwan Espionage Campaign",
    "url": "https://thehackernews.com/2025/08/abandoned-sogou-zhuyin-update-server.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T13:12:00",
    "summary": "An abandoned update server associated with input method editor (IME) software Sogou Zhuyin was leveraged by threat actors as part of an espionage campaign to deliver several malware families, including C6DOOR and GTELAM, in attacks primarily targeting users across Eastern Asia. \"Attackers employed sophisticated infection chains, such as hijacked software updates and fake cloud storage or login",
    "content": "An abandoned update server associated with input method editor (IME) software Sogou Zhuyin was leveraged by threat actors as part of an espionage campaign to deliver several malware families, including C6DOOR and GTELAM, in attacks primarily targeting users across Eastern Asia. \"Attackers employed sophisticated infection chains, such as hijacked software updates and fake cloud storage or login",
    "keywords": [
      "malware"
    ],
    "priority_score": 15,
    "article_id": "4231edd18a26"
  },
  {
    "title": "Click Studios Patches Passwordstate Authentication Bypass Vulnerability in Emergency Access Page",
    "url": "https://thehackernews.com/2025/08/click-studios-patches-passwordstate.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T09:58:00",
    "summary": "Click Studios, the developer of enterprise-focused password management solution Passwordstate, said it has released security updates to address an authentication bypass vulnerability in its software. The high-severity issue, which is yet to be assigned a CVE identifier, has been addressed in Passwordstate 9.9 (Build 9972), released August 28, 2025. The Australian company said it fixed a \"",
    "content": "Click Studios, the developer of enterprise-focused password management solution Passwordstate, said it has released security updates to address an authentication bypass vulnerability in its software. The high-severity issue, which is yet to be assigned a CVE identifier, has been addressed in Passwordstate 9.9 (Build 9972), released August 28, 2025. The Australian company said it fixed a \"",
    "keywords": [
      "vulnerability"
    ],
    "priority_score": 15,
    "article_id": "77810e3891fe"
  },
  {
    "title": "TamperedChef Malware Disguised as Fake PDF Editors Steals Credentials and Cookies",
    "url": "https://thehackernews.com/2025/08/tamperedchef-malware-disguised-as-fake.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T04:17:00",
    "summary": "Cybersecurity researchers have discovered a cybercrime campaign that's using malvertising tricks to direct victims to fraudulent sites to deliver a new information stealer called TamperedChef. \"The objective is to lure victims into downloading and installing a trojanized PDF editor, which includes an information-stealing malware dubbed TamperedChef,\" Truesec researchers Mattias Wåhlén, Nicklas",
    "content": "Cybersecurity researchers have discovered a cybercrime campaign that's using malvertising tricks to direct victims to fraudulent sites to deliver a new information stealer called TamperedChef. \"The objective is to lure victims into downloading and installing a trojanized PDF editor, which includes an information-stealing malware dubbed TamperedChef,\" Truesec researchers Mattias Wåhlén, Nicklas",
    "keywords": [
      "malware"
    ],
    "priority_score": 15,
    "article_id": "0adaf3e52a60"
  },
  {
    "title": "Researchers Find VS Code Flaw Allowing Attackers to Republish Deleted Extensions Under Same Names",
    "url": "https://thehackernews.com/2025/08/researchers-find-vs-code-flaw-allowing.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-28T17:10:00",
    "summary": "Cybersecurity researchers have discovered a loophole in the Visual Studio Code Marketplace that allows threat actors to reuse names of previously removed extensions. Software supply chain security outfit ReversingLabs said it made the discovery after it identified a malicious extension named \"ahbanC.shiba\" that functioned similarly to two other extensions – ahban.shiba and ahban.cychelloworld –",
    "content": "Cybersecurity researchers have discovered a loophole in the Visual Studio Code Marketplace that allows threat actors to reuse names of previously removed extensions. Software supply chain security outfit ReversingLabs said it made the discovery after it identified a malicious extension named \"ahbanC.shiba\" that functioned similarly to two other extensions – ahban.shiba and ahban.cychelloworld –",
    "keywords": [
      "supply chain"
    ],
    "priority_score": 15,
    "article_id": "37567af188ac"
  },
  {
    "title": "Hidden Vulnerabilities of Project Management Tools & How FluentPro Backup Secures Them",
    "url": "https://thehackernews.com/2025/08/hidden-vulnerabilities-of-project.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-28T11:00:00",
    "summary": "Every day, businesses, teams, and project managers trust platforms like Trello, Asana, etc., to collaborate and manage tasks. But what happens when that trust is broken? According to a recent report by Statista, the average cost of a data breach worldwide was about $4.88 million. Also, in 2024, the private data of over 15 million Trello user profiles was shared on a popular hacker forum. Yet,",
    "content": "Every day, businesses, teams, and project managers trust platforms like Trello, Asana, etc., to collaborate and manage tasks. But what happens when that trust is broken? According to a recent report by Statista, the average cost of a data breach worldwide was about $4.88 million. Also, in 2024, the private data of over 15 million Trello user profiles was shared on a popular hacker forum. Yet,",
    "keywords": [
      "data breach"
    ],
    "priority_score": 15,
    "article_id": "8c560f727979"
  },
  {
    "title": "Malicious Nx Packages in ‘s1ngularity’ Attack Leaked 2,349 GitHub, Cloud, and AI Credentials",
    "url": "https://thehackernews.com/2025/08/malicious-nx-packages-in-s1ngularity.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-28T10:36:00",
    "summary": "The maintainers of the nx build system have alerted users to a supply chain attack that allowed attackers to publish malicious versions of the popular npm package and other auxiliary plugins with data-gathering capabilities. \"Malicious versions of the nx package, as well as some supporting plugin packages, were published to npm, containing code that scans the file system, collects credentials,",
    "content": "The maintainers of the nx build system have alerted users to a supply chain attack that allowed attackers to publish malicious versions of the popular npm package and other auxiliary plugins with data-gathering capabilities. \"Malicious versions of the nx package, as well as some supporting plugin packages, were published to npm, containing code that scans the file system, collects credentials,",
    "keywords": [
      "supply chain"
    ],
    "priority_score": 15,
    "article_id": "89a983658a8b"
  },
  {
    "title": "Someone Created the First AI-Powered Ransomware Using OpenAI's gpt-oss:20b Model",
    "url": "https://thehackernews.com/2025/08/someone-created-first-ai-powered.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-27T17:07:00",
    "summary": "Cybersecurity company ESET has disclosed that it discovered an artificial intelligence (AI)-powered ransomware variant codenamed PromptLock. Written in Golang, the newly identified strain uses the gpt-oss:20b model from OpenAI locally via the Ollama API to generate malicious Lua scripts in real-time. The open-weight language model was released by OpenAI earlier this month. \"PromptLock",
    "content": "Cybersecurity company ESET has disclosed that it discovered an artificial intelligence (AI)-powered ransomware variant codenamed PromptLock. Written in Golang, the newly identified strain uses the gpt-oss:20b model from OpenAI locally via the Ollama API to generate malicious Lua scripts in real-time. The open-weight language model was released by OpenAI earlier this month. \"PromptLock",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 15,
    "article_id": "e39b30022fa7"
  },
  {
    "title": "CISA, FBI, NSA Warn of Chinese 'Global Espionage System'",
    "url": "https://www.darkreading.com/cybersecurity-operations/cisa-fbi-nsa-warn-chinese-global-espionage-system",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-28T20:10:08",
    "summary": "Three federal agencies were parties to a global security advisory this week warning about the extensive threat posed by Chinese nation-state actors targeting network devices.",
    "content": "Three federal agencies were parties to a global security advisory this week warning about the extensive threat posed by Chinese nation-state actors targeting network devices.",
    "keywords": [
      "nation-state"
    ],
    "priority_score": 15,
    "article_id": "95f7ac5fd19c"
  },
  {
    "title": "Akira, Cl0p Top List of 5 Most Active Ransomware-as-a-Service Groups",
    "url": "https://www.darkreading.com/threat-intelligence/akira-clop-top-5-most-active-ransomware-groups-list",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-28T18:49:55",
    "summary": "Many familiar faces made Flashpoint's 2025 midyear ransomware report, as well as new gangs, which are increasingly using AI.",
    "content": "Many familiar faces made Flashpoint's 2025 midyear ransomware report, as well as new gangs, which are increasingly using AI.",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 15,
    "article_id": "4035e7285664"
  },
  {
    "title": "1,000+ Devs Lose Their Secrets to an AI-Powered Stealer",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/1000-devs-lose-secrets-ai-powered-stealer",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-28T18:39:25",
    "summary": "One of the most sophisticated supply chain attacks to date caused immense amounts of data to leak to the Web in a matter of hours.",
    "content": "One of the most sophisticated supply chain attacks to date caused immense amounts of data to leak to the Web in a matter of hours.",
    "keywords": [
      "supply chain"
    ],
    "priority_score": 15,
    "article_id": "97a66e830b08"
  },
  {
    "title": "Dark Reading Confidential: A Guided Tour of Today's Dark Web",
    "url": "https://www.darkreading.com/cyber-risk/dark-reading-confidential-guided-tour-dark-web",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-28T18:00:19",
    "summary": "Dark Reading Confidential Episode 9: Join us for a look around today's Dark Web, and find out how law enforcement, AI, nation-state activities, and more are reshaping the way cybercriminals conduct their dirty business online. Keith Jarvis, senior security researcher at Sophos' Counter Threat Unit joins Dark Reading's Alex Culafi for a conversation you don't want to miss.",
    "content": "Dark Reading Confidential Episode 9: Join us for a look around today's Dark Web, and find out how law enforcement, AI, nation-state activities, and more are reshaping the way cybercriminals conduct their dirty business online. Keith Jarvis, senior security researcher at Sophos' Counter Threat Unit joins Dark Reading's Alex Culafi for a conversation you don't want to miss.",
    "keywords": [
      "nation-state"
    ],
    "priority_score": 15,
    "article_id": "b0aa3dc0e11a"
  },
  {
    "title": "Storm-0501 Hits Enterprise With 'Cloud-Based Ransomware' Attack",
    "url": "https://www.darkreading.com/cloud-security/storm-0501-cloud-based-ransomware-attack",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T16:00:00",
    "summary": "The financially motivated threat group used cloud resources to conduct a complex, ransomware-style attack against an enterprise victim.",
    "content": "The financially motivated threat group used cloud resources to conduct a complex, ransomware-style attack against an enterprise victim.",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 15,
    "article_id": "7ac6723a1a5f"
  },
  {
    "title": "AI-Powered Ransomware Has Arrived With 'PromptLock'",
    "url": "https://www.darkreading.com/vulnerabilities-threats/ai-powered-ransomware-promptlock",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T13:27:04",
    "summary": "Researchers raise the alarm that a new, rapidly evolving ransomware strain uses an OpenAI model to render and execute malicious code in real time, ushering in a new era of cyberattacks against enterprises.",
    "content": "Researchers raise the alarm that a new, rapidly evolving ransomware strain uses an OpenAI model to render and execute malicious code in real time, ushering in a new era of cyberattacks against enterprises.",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 15,
    "article_id": "0a9b0e403a25"
  },
  {
    "title": "When One Hospital Gets Ransomware, Others Feel the Pain",
    "url": "https://www.darkreading.com/cybersecurity-operations/hospital-gets-ransomware-others-feel-pain",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-26T21:00:29",
    "summary": "Without key security defenses, including backup recovery and multifactor authentication implementation, all parties, including neighboring hospitals and patients, suffer.",
    "content": "Without key security defenses, including backup recovery and multifactor authentication implementation, all parties, including neighboring hospitals and patients, suffer.",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 15,
    "article_id": "53100e4fac27"
  },
  {
    "title": "TransUnion Data Breach Impacts 4.4 Million",
    "url": "https://www.securityweek.com/transunion-data-breach-impacts-4-4-million/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T12:36:02",
    "summary": "The credit reporting firm did not name the third-party application involved in the incident, only noting that it was used for its US consumer support operations. The post TransUnion Data Breach Impacts 4.4 Million appeared first on SecurityWeek.",
    "content": "The credit reporting firm did not name the third-party application involved in the incident, only noting that it was used for its US consumer support operations. The post TransUnion Data Breach Impacts 4.4 Million appeared first on SecurityWeek.",
    "keywords": [
      "data breach"
    ],
    "priority_score": 13,
    "article_id": "ba140ad730df"
  },
  {
    "title": "Nevada Confirms Ransomware Attack Behind Statewide Service Disruptions",
    "url": "https://www.securityweek.com/nevada-confirms-ransomware-attack-behind-statewide-service-disruptions/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T12:28:45",
    "summary": "State officials confirm ransomware forced office closures, disrupted services, and led to data theft, as Nevada works with CISA and law enforcement to restore critical systems. The post Nevada Confirms Ransomware Attack Behind Statewide Service Disruptions appeared first on SecurityWeek.",
    "content": "State officials confirm ransomware forced office closures, disrupted services, and led to data theft, as Nevada works with CISA and law enforcement to restore critical systems. The post Nevada Confirms Ransomware Attack Behind Statewide Service Disruptions appeared first on SecurityWeek.",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 13,
    "article_id": "655c97b52d24"
  },
  {
    "title": "Webinar Today: Ransomware Defense That Meets Evolving Compliance Mandates",
    "url": "https://www.securityweek.com/webinar-today-ransomware-defense-that-meets-evolving-compliance-mandates/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-28T11:05:58",
    "summary": "Join this live discussion to learn how organizations can strengthen ransomware defenses while staying ahead of tightening compliance requirements. The post Webinar Today: Ransomware Defense That Meets Evolving Compliance Mandates appeared first on SecurityWeek.",
    "content": "Join this live discussion to learn how organizations can strengthen ransomware defenses while staying ahead of tightening compliance requirements. The post Webinar Today: Ransomware Defense That Meets Evolving Compliance Mandates appeared first on SecurityWeek.",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 13,
    "article_id": "b962a8db2cf7"
  },
  {
    "title": "Passwordstate dev urges users to patch auth bypass vulnerability",
    "url": "https://www.bleepingcomputer.com/news/security/passwordstate-dev-urges-users-to-patch-auth-bypass-vulnerability-as-soon-as-possible/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T16:16:20",
    "summary": "Click Studios, the company behind the Passwordstate enterprise-grade password manager, has warned customers to patch a high-severity authentication bypass vulnerability as soon as possible. [...]",
    "content": "Click Studios, the company behind the Passwordstate enterprise-grade password manager, has warned customers to patch a high-severity authentication bypass vulnerability as soon as possible. [...]",
    "keywords": [
      "vulnerability"
    ],
    "priority_score": 10,
    "article_id": "b996c860ba41"
  },
  {
    "title": "MATLAB dev says ransomware gang stole data of 10,000 people",
    "url": "https://www.bleepingcomputer.com/news/security/matlab-dev-says-ransomware-gang-stole-data-of-over-10-000-people/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T15:00:06",
    "summary": "MathWorks, a leading developer of mathematical simulation and computing software, revealed that a ransomware gang stole the data of over 10,000 people after breaching its network in April. [...]",
    "content": "MathWorks, a leading developer of mathematical simulation and computing software, revealed that a ransomware gang stole the data of over 10,000 people after breaching its network in April. [...]",
    "keywords": [
      "ransomware"
    ],
    "priority_score": 10,
    "article_id": "8aee44278345"
  },
  {
    "title": "Affiliates Flock to ‘Soulless’ Scam Gambling Machine",
    "url": "https://krebsonsecurity.com/2025/08/affiliates-flock-to-soulless-scam-gambling-machine/",
    "source": "Krebs on Security",
    "category": "general",
    "published_date": "2025-08-28T17:21:32",
    "summary": "Last month, KrebsOnSecurity tracked the sudden emergence of hundreds of polished online gaming and wagering websites that lure people with free credits and eventually abscond with any cryptocurrency funds deposited by players. We've since learned that these scam gambling sites have proliferated thanks to a new Russian affiliate program called \"Gambler Panel\" that bills itself as a \"soulless project that is made for profit.\"",
    "content": "Last month, KrebsOnSecurity tracked the sudden emergence of hundreds of polished online gaming and wagering websites that lure people with free credits and eventually abscond with any cryptocurrency funds deposited by players. We&#8217;ve since learned that these scam gambling sites have proliferated thanks to a new Russian affiliate program called &#8220;Gambler Panel&#8221; that bills itself as a &#8220;soulless project that is made for profit.&#8221; A machine-translated version of Gambler Panel&#8217;s affiliate website. The scam begins with deceptive ads posted on social media that claim the wagering sites are working in partnership with popular athletes or social media personalities. The ads invariably state that by using a supplied &#8220;promo code,&#8221; interested players can claim a $2,500 credit on the advertised gaming website. The gaming sites ask visitors to create a free account to claim their $2,500 credit, which they can use to play any number of extremely polished video games that ask users to bet on each action. However, when users try to cash out any &#8220;winnings&#8221; the gaming site will reject the request and prompt the user to make a “verification deposit” of cryptocurrency — typically around $100 — before any money can be distributed. Those who deposit cryptocurrency funds are soon pressed into more wagering and making additional deposits. And &#8212; shocker alert &#8212; all players eventually lose everything they&#8217;ve invested in the platform. The number of scam gambling or &#8220;scambling&#8221; sites has skyrocketed in the past month, and now we know why: The sites all pull their gaming content and detailed strategies for fleecing players straight from the playbook created by Gambler Panel, a Russian-language affiliate program that promises affiliates up to 70 percent of the profits. Gambler Panel&#8217;s website gambler-panel[.]com links to a helpful wiki that explains the scam from cradle to grave, offering affiliates advice on how best to entice visitors, keep them gambling, and extract maximum profits from each victim. &#8220;We have a completely self-written from scratch FAKE CASINO engine that has no competitors,&#8221; Gambler Panel&#8217;s wiki enthuses. &#8220;Carefully thought-out casino design in every pixel, a lot of audits, surveys of real people and test traffic floods were conducted, which allowed us to create something that has no doubts about the legitimacy and trustworthiness even for an inveterate gambling addict with many years of experience.&#8221; Gambler Panel explains that the one and only goal of affiliates is to drive traffic to these scambling sites by any and all means possible. A machine-translated portion of Gambler Panel&#8217;s singular instruction for affiliates: Drive traffic to these scambling sites by any means available. &#8220;Unlike white gambling affiliates, we accept absolutely any type of traffic, regardless of origin, the only limitation is the CIS countries,&#8221; the wiki continued, referring to a common prohibition against scamming people in Russia and former Soviet republics in the Commonwealth of Independent States. The program&#8217;s website claims it has more than 20,000 affiliates, who earn a minimum of $10 for each verification deposit. Interested new affiliates must first get approval from the group&#8217;s Telegram channel, which currently has around 2,500 active users. The Gambler Panel channel is replete with images of affiliate panels showing the daily revenue of top affiliates, scantily-clad young women promoting the Gambler logo, and fast cars that top affiliates claimed they bought with their earnings. A machine-translated version of the wiki for the affiliate program Gambler Panel. The apparent popularity of this scambling niche is a consequence of the program&#8217;s ease of use and detailed instructions for successfully reproducing virtually every facet of the scam. Indeed, much of the tutorial focuses on advice and ready-made templates to help even novice affiliates drive traffic via social media websites, particularly on Instagram and TikTok. Gambler Panel also walks affiliates through a range of possible responses to questions from users who are trying to withdraw funds from the platform. This section, titled &#8220;Rules for working in Live chat,&#8221; urges scammers to respond quickly to user requests (1-7 minutes), and includes numerous strategies for keeping the conversation professional and the user on the platform as long as possible. A machine-translated version of the Gambler Panel&#8217;s instructions on managing chat support conversations with users. The connection between Gambler Panel and the explosion in the number of scambling websites was made by a 17-year-old developer who operates multiple Discord servers that have been flooded lately with misleading ads for these sites. The researcher, who asked to be identified only by the nickname &#8220;Thereallo,&#8221; said Gambler Panel has built a scalable business product for other criminals. &#8220;The wiki is kinda like a &#8216;how to scam 101&#8217; for criminals written with the clarity you would expect from a legitimate company,&#8221; Thereallo said. &#8220;It&#8217;s clean, has step by step guides, and treats their scam platform like a real product. You could swap out the content, and it could be any documentation for startups.&#8221; &#8220;They&#8217;ve minimized their own risk &#8212; spreading the links on Discord / Facebook / YT Shorts, etc. &#8212; and outsourced it to a hungry affiliate network, just like a franchise,&#8221; Thereallo wrote in response to questions. &#8220;A centralized platform that can serve over 1,200 domains with a shared user base, IP tracking, and a custom API is not at all a trivial thing to build,&#8221; Thereallo said. &#8220;It&#8217;s a scalable system designed to be a resilient foundation for thousands of disposable scam sites.&#8221; The security firm Silent Push has compiled a list of the latest domains associated with the Gambler Panel, available here (.csv).",
    "keywords": [],
    "priority_score": 5,
    "article_id": "840a92f8f7f3"
  },
  {
    "title": "Can Your Security Stack See ChatGPT? Why Network Visibility Matters",
    "url": "https://thehackernews.com/2025/08/can-your-security-stack-see-chatgpt-why.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T10:30:00",
    "summary": "Generative AI platforms like ChatGPT, Gemini, Copilot, and Claude are increasingly common in organizations. While these solutions improve efficiency across tasks, they also present new data leak prevention for generative AI challenges. Sensitive information may be shared through chat prompts, files uploaded for AI-driven summarization, or browser plugins that bypass familiar security controls.",
    "content": "Generative AI platforms like ChatGPT, Gemini, Copilot, and Claude are increasingly common in organizations. While these solutions improve efficiency across tasks, they also present new data leak prevention for generative AI challenges. Sensitive information may be shared through chat prompts, files uploaded for AI-driven summarization, or browser plugins that bypass familiar security controls.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "848e6f2e1b37"
  },
  {
    "title": "Feds Seize $6.4M VerifTools Fake-ID Marketplace, but Operators Relaunch on New Domain",
    "url": "https://thehackernews.com/2025/08/feds-seize-64m-veriftools-fake-id.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T09:05:00",
    "summary": "Authorities from the Netherlands and the United States have announced the dismantling of an illicit marketplace called VerifTools that peddled fraudulent identity documents to cybercriminals across the world. To that end, two marketplace domains (verif[.]tools and veriftools[.]net) and one blog have been taken down, redirecting site visitors to a splash page stating the action was undertaken by",
    "content": "Authorities from the Netherlands and the United States have announced the dismantling of an illicit marketplace called VerifTools that peddled fraudulent identity documents to cybercriminals across the world. To that end, two marketplace domains (verif[.]tools and veriftools[.]net) and one blog have been taken down, redirecting site visitors to a splash page stating the action was undertaken by",
    "keywords": [],
    "priority_score": 5,
    "article_id": "f490ba9f2153"
  },
  {
    "title": "Google Warns Salesloft Drift Breach Impacts All Drift Integrations Beyond Salesforce",
    "url": "https://thehackernews.com/2025/08/google-warns-salesloft-oauth-breach.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-29T07:24:00",
    "summary": "Google has revealed that the recent wave of attacks targeting Salesforce instances via Salesloft Drift is much broader in scope than previously thought, stating it impacts all integrations. \"We now advise all Salesloft Drift customers to treat any and all authentication tokens stored in or connected to the Drift platform as potentially compromised,\" Google Threat Intelligence Group (GTIG) and",
    "content": "Google has revealed that the recent wave of attacks targeting Salesforce instances via Salesloft Drift is much broader in scope than previously thought, stating it impacts all integrations. \"We now advise all Salesloft Drift customers to treat any and all authentication tokens stored in or connected to the Drift platform as potentially compromised,\" Google Threat Intelligence Group (GTIG) and",
    "keywords": [],
    "priority_score": 5,
    "article_id": "a32b5548f86d"
  },
  {
    "title": "U.S. Treasury Sanctions DPRK IT-Worker Scheme, Exposing $600K Crypto Transfers and $1M+ Profits",
    "url": "https://thehackernews.com/2025/08/us-treasury-sanctions-dprk-it-worker.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-28T08:53:00",
    "summary": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) announced a fresh round of sanctions against two individuals and two entities for their role in the North Korean remote information technology (IT) worker scheme to generate illicit revenue for the regime's weapons of mass destruction and ballistic missile programs. \"The North Korean regime continues to target American",
    "content": "The U.S. Department of the Treasury's Office of Foreign Assets Control (OFAC) announced a fresh round of sanctions against two individuals and two entities for their role in the North Korean remote information technology (IT) worker scheme to generate illicit revenue for the regime's weapons of mass destruction and ballistic missile programs. \"The North Korean regime continues to target American",
    "keywords": [],
    "priority_score": 5,
    "article_id": "6a20eac27200"
  },
  {
    "title": "Anthropic Disrupts AI-Powered Cyberattacks Automating Theft and Extortion Across Critical Sectors",
    "url": "https://thehackernews.com/2025/08/anthropic-disrupts-ai-powered.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-27T15:10:00",
    "summary": "Anthropic on Wednesday revealed that it disrupted a sophisticated operation that weaponized its artificial intelligence (AI)-powered chatbot Claude to conduct large-scale theft and extortion of personal data in July 2025. \"The actor targeted at least 17 distinct organizations, including in healthcare, the emergency services, and government, and religious institutions,\" the company said. \"",
    "content": "Anthropic on Wednesday revealed that it disrupted a sophisticated operation that weaponized its artificial intelligence (AI)-powered chatbot Claude to conduct large-scale theft and extortion of personal data in July 2025. \"The actor targeted at least 17 distinct organizations, including in healthcare, the emergency services, and government, and religious institutions,\" the company said. \"",
    "keywords": [],
    "priority_score": 5,
    "article_id": "5ca343ab6d31"
  },
  {
    "title": "ShadowSilk Hits 35 Organizations in Central Asia and APAC Using Telegram Bots",
    "url": "https://thehackernews.com/2025/08/shadowsilk-hits-36-government-targets.html",
    "source": "The Hacker News",
    "category": "general",
    "published_date": "2025-08-27T13:47:00",
    "summary": "A threat activity cluster known as ShadowSilk has been attributed to a fresh set of attacks targeting government entities within Central Asia and Asia-Pacific (APAC). According to Group-IB, nearly three dozen victims have been identified, with the intrusions mainly geared towards data exfiltration. The hacking group shares toolset and infrastructural overlaps with campaigns undertaken by threat",
    "content": "A threat activity cluster known as ShadowSilk has been attributed to a fresh set of attacks targeting government entities within Central Asia and Asia-Pacific (APAC). According to Group-IB, nearly three dozen victims have been identified, with the intrusions mainly geared towards data exfiltration. The hacking group shares toolset and infrastructural overlaps with campaigns undertaken by threat",
    "keywords": [],
    "priority_score": 5,
    "article_id": "7f0b8e016e52"
  },
  {
    "title": "An Audit Isn't a Speed Bump — It's Your Cloud Co-Pilot",
    "url": "https://www.darkreading.com/cybersecurity-operations/audit-speed-bump-cloud-co-pilot",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-29T14:00:00",
    "summary": "Auditing must be seen for what it truly can be: a multiplier of trust, not a bottleneck of progress.",
    "content": "Auditing must be seen for what it truly can be: a multiplier of trust, not a bottleneck of progress.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "b62dfd4222ec"
  },
  {
    "title": "Hackers Steal 4M+ TransUnion Customers' Data",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/hackers-transunion-customer-data",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-28T19:25:50",
    "summary": "The credit reporting agency said the breach was &quot;limited to specific data elements&quot; and didn't include credit reports or core credit information.",
    "content": "The credit reporting agency said the breach was &quot;limited to specific data elements&quot; and didn't include credit reports or core credit information.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "ea6f163103f9"
  },
  {
    "title": "CISA's New SBOM Guidelines Get Mixed Reviews",
    "url": "https://www.darkreading.com/application-security/cisas-new-sbom-guidelines-mixed-reviews",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-28T15:17:50",
    "summary": "Updated SBOM rules from CISA are a solid step toward making them more useful for cyber defenders but don't address many critical needs, experts say.",
    "content": "Updated SBOM rules from CISA are a solid step toward making them more useful for cyber defenders but don't address many critical needs, experts say.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "1ca7b48d23f4"
  },
  {
    "title": "CrowdStrike to Acquire Onum, Boost Falcon Next-Gen SIEM",
    "url": "https://www.darkreading.com/cybersecurity-analytics/crowdstrike-acquire-onum-boost-falcon-next-gen-siem",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T23:18:53",
    "summary": "The acquisition will bring Onum's real-time data pipeline to CrowdStrike's Falcon Next-Gen SIEM platform to deliver autonomous threat detection capabilities.",
    "content": "The acquisition will bring Onum's real-time data pipeline to CrowdStrike's Falcon Next-Gen SIEM platform to deliver autonomous threat detection capabilities.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "00f5a3d73542"
  },
  {
    "title": "Anthropic AI Used to Automate Data Extortion Campaign",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/anthropic-ai-automate-data-extortion-campaign",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T21:15:08",
    "summary": "The company said the threat actor abused its Claude Code service to &quot;an unprecedented degree,&quot; automating reconnaissance, intrusions, and credential harvesting.",
    "content": "The company said the threat actor abused its Claude Code service to &quot;an unprecedented degree,&quot; automating reconnaissance, intrusions, and credential harvesting.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "9653d6a05934"
  },
  {
    "title": "'ZipLine' Phishers Flip Script as Victims Email First",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/zipline-phishers-victims-email-first",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T20:35:28",
    "summary": "&quot;ZipLine&quot; appears to be a sophisticated and carefully planned campaign that has already affected dozens of small, medium, and large organizations across multiple industry sectors.",
    "content": "&quot;ZipLine&quot; appears to be a sophisticated and carefully planned campaign that has already affected dozens of small, medium, and large organizations across multiple industry sectors.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "aed3d89e548a"
  },
  {
    "title": "Nevada's State Agencies Shutter in Wake of Cyberattack",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/nevada-state-agencies-cyberattack",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T19:59:53",
    "summary": "In response to a cyberattack that was first detected on Sunday, the governor shut down in-person services for state offices while restoration efforts are underway.",
    "content": "In response to a cyberattack that was first detected on Sunday, the governor shut down in-person services for state offices while restoration efforts are underway.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "9d980d425ade"
  },
  {
    "title": "Google: Salesforce Attacks Stemmed From Third-Party App",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/google-salesforce-attacks-third-party-app",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T19:05:37",
    "summary": "A group tracked as UNC6395 engaged in &quot;widespread data theft&quot; via compromised OAuth tokens from a third-party app called Salesloft Drift.",
    "content": "A group tracked as UNC6395 engaged in &quot;widespread data theft&quot; via compromised OAuth tokens from a third-party app called Salesloft Drift.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "8a17c605a38c"
  },
  {
    "title": "Gaps in California Privacy Law: Half of Data Brokers Ignore Requests",
    "url": "https://www.darkreading.com/data-privacy/gaps-in-california-privacy-law-half-of-data-brokers-ignore-requests",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T13:24:41",
    "summary": "Failure to comply with consumer data access and deletion requests highlights the urgent need for standardized verification processes and stronger enforcement mechanisms to protect consumer privacy.",
    "content": "Failure to comply with consumer data access and deletion requests highlights the urgent need for standardized verification processes and stronger enforcement mechanisms to protect consumer privacy.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "4866ccae0c2b"
  },
  {
    "title": "African Law Enforcement Agencies Nab Cybercrime Syndicates",
    "url": "https://www.darkreading.com/cyberattacks-data-breaches/african-law-enforcement-agencies-nab-cybercrime-syndicates",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-27T06:00:00",
    "summary": "African nations work with Interpol and private-sector partners to disrupt cybercriminal operations on the continent, but more work needs to be done.",
    "content": "African nations work with Interpol and private-sector partners to disrupt cybercriminal operations on the continent, but more work needs to be done.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "3ce27b2b237a"
  },
  {
    "title": "AI Agents in Browsers Light on Cybersecurity, Bypass Controls",
    "url": "https://www.darkreading.com/application-security/ai-agentic-browsers-light-cybersecurity-bypass-controls",
    "source": "Dark Reading",
    "category": "general",
    "published_date": "2025-08-26T20:53:17",
    "summary": "Companies looking to benefit from agentic browsers pause: The services can tap into a user's online accounts and automate tasks but can expose organizational data and systems to myriad threats.",
    "content": "Companies looking to benefit from agentic browsers pause: The services can tap into a user's online accounts and automate tasks but can expose organizational data and systems to myriad threats.",
    "keywords": [],
    "priority_score": 5,
    "article_id": "5734d7d82fc6"
  },
  {
    "title": "In Other News: Iranian Ships Hacked, Verified Android Developers, AI Used in Attacks",
    "url": "https://www.securityweek.com/in-other-news-iranian-ships-hacked-verified-android-developers-ai-used-in-attacks/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T14:26:07",
    "summary": "Noteworthy stories that might have slipped under the radar: communications of dozens of Iranian ships disrupted, only apps from verified developers will run on Android devices, and AI used across multiple phases of malicious attacks. The post In Other News: Iranian Ships Hacked, Verified Android Developers, AI Used in Attacks appeared first on SecurityWeek.",
    "content": "Noteworthy stories that might have slipped under the radar: communications of dozens of Iranian ships disrupted, only apps from verified developers will run on Android devices, and AI used across multiple phases of malicious attacks. The post In Other News: Iranian Ships Hacked, Verified Android Developers, AI Used in Attacks appeared first on SecurityWeek.",
    "keywords": [],
    "priority_score": 3,
    "article_id": "5a68759bd78c"
  },
  {
    "title": "VerifTools Fake ID Operation Dismantled by Law Enforcement",
    "url": "https://www.securityweek.com/veriftools-fake-id-operation-dismantled-by-law-enforcement/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T14:18:29",
    "summary": "Authorities say VerifTools sold fake driver’s licenses and passports worldwide, enabling fraudsters to bypass KYC checks and access online accounts. The post VerifTools Fake ID Operation Dismantled by Law Enforcement appeared first on SecurityWeek.",
    "content": "Authorities say VerifTools sold fake driver’s licenses and passports worldwide, enabling fraudsters to bypass KYC checks and access online accounts. The post VerifTools Fake ID Operation Dismantled by Law Enforcement appeared first on SecurityWeek.",
    "keywords": [],
    "priority_score": 3,
    "article_id": "9b5d814fb8a6"
  },
  {
    "title": "Google Confirms Workspace Accounts Also Hit in Salesforce–Salesloft Drift Data Theft Campaign",
    "url": "https://www.securityweek.com/google-confirms-workspace-accounts-also-hit-in-salesforce-salesloft-drift-data-theft-campaign/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-29T12:40:57",
    "summary": "Google says the same OAuth token compromise that enabled Salesforce data theft also let hackers access a small number of Workspace accounts via the Salesloft Drift integration. The post Google Confirms Workspace Accounts Also Hit in Salesforce–Salesloft Drift Data Theft Campaign appeared first on SecurityWeek.",
    "content": "Google says the same OAuth token compromise that enabled Salesforce data theft also let hackers access a small number of Workspace accounts via the Salesloft Drift integration. The post Google Confirms Workspace Accounts Also Hit in Salesforce–Salesloft Drift Data Theft Campaign appeared first on SecurityWeek.",
    "keywords": [],
    "priority_score": 3,
    "article_id": "e5eba3e74019"
  },
  {
    "title": "CrowdStrike to Acquire Onum to Fuel Falcon Next-Gen SIEM With Real-Time Telemetry",
    "url": "https://www.securityweek.com/crowdstrike-to-acquire-onum-to-fuel-falcon-next-gen-siem-with-real-time-telemetry/",
    "source": "SecurityWeek",
    "category": "industry",
    "published_date": "2025-08-28T12:02:04",
    "summary": "CrowdStrike says the acquisition will bring valuable technology to enhance its Falcon Next-Gen SIEM. The post CrowdStrike to Acquire Onum to Fuel Falcon Next-Gen SIEM With Real-Time Telemetry appeared first on SecurityWeek.",
    "content": "CrowdStrike says the acquisition will bring valuable technology to enhance its Falcon Next-Gen SIEM. The post CrowdStrike to Acquire Onum to Fuel Falcon Next-Gen SIEM With Real-Time Telemetry appeared first on SecurityWeek.",
    "keywords": [],
    "priority_score": 3,
    "article_id": "6c5d91df382d"
  },
  {
    "title": "Windows 11 KB5064081 update clears up CPU usage metrics in Task Manager",
    "url": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5064081-update-clears-up-cpu-usage-metrics-in-task-manager/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-29T18:57:04",
    "summary": "Microsoft has released the KB5064081 preview cumulative update for Windows 11 24H2, which includes thirty-six new features or changes, with many gradually rolling out. These updates include new Recall features and a new way of displaying CPU usage in Task Manager. [...]",
    "content": "Microsoft has released the KB5064081 preview cumulative update for Windows 11 24H2, which includes thirty-six new features or changes, with many gradually rolling out. These updates include new Recall features and a new way of displaying CPU usage in Task Manager. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "2ecc345d5c2a"
  },
  {
    "title": "Microsoft fixes bug behind Windows certificate enrollment errors",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-fixes-bug-behind-windows-certificate-enrollment-errors/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-29T18:02:25",
    "summary": "Microsoft has resolved a known issue causing false CertificateServicesClient (CertEnroll) error messages after installing the July 2025 preview and subsequent Windows 11 24H2 updates. [...]",
    "content": "Microsoft has resolved a known issue causing false CertificateServicesClient (CertEnroll) error messages after installing the July 2025 preview and subsequent Windows 11 24H2 updates. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "5507e0ac0a08"
  },
  {
    "title": "Microsoft to enforce MFA for Azure resource management in October",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-enforce-mfa-for-azure-resource-management-in-october/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-29T15:56:47",
    "summary": "Starting in October, Microsoft will enforce multi-factor authentication (MFA) for all Azure resource management actions to protect Azure clients from unauthorized access attempts. [...]",
    "content": "Starting in October, Microsoft will enforce multi-factor authentication (MFA) for all Azure resource management actions to protect Azure clients from unauthorized access attempts. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "e900291d78f0"
  },
  {
    "title": "Microsoft says recent Windows update didn't kill your SSD",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-says-recent-KB5063878-windows-update-didnt-kill-your-ssd/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-29T14:21:27",
    "summary": "Microsoft has found no link between the August 2025 KB5063878 security update and customer reports of failure and data corruption issues affecting solid-state drives (SSDs) and hard disk drives (HDDs). [...]",
    "content": "Microsoft has found no link between the August 2025 KB5063878 security update and customer reports of failure and data corruption issues affecting solid-state drives (SSDs) and hard disk drives (HDDs). [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "6201423bfb49"
  },
  {
    "title": "Google warns Salesloft breach impacted some Workspace accounts",
    "url": "https://www.bleepingcomputer.com/news/security/google-warns-salesloft-breach-impacted-some-workspace-accounts/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T22:09:24",
    "summary": "Google reports that the Salesloft Drift breach is larger than initially thought, warning that attackers also used stolen OAuth tokens to access Google Workspace email accounts in addition to Salesforce data. [...]",
    "content": "Google reports that the Salesloft Drift breach is larger than initially thought, warning that attackers also used stolen OAuth tokens to access Google Workspace email accounts in addition to Salesforce data. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "b79db697d537"
  },
  {
    "title": "US targets North Korean IT worker army with new sanctions",
    "url": "https://www.bleepingcomputer.com/news/legal/us-targets-north-korean-it-worker-army-with-new-sanctions/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T19:11:23",
    "summary": "The U.S. Treasury's Office of Foreign Assets Control (OFAC) has sanctioned two individuals and two companies associated with North Korean IT worker schemes that operate at the expense of American organizations. [...]",
    "content": "The U.S. Treasury's Office of Foreign Assets Control (OFAC) has sanctioned two individuals and two companies associated with North Korean IT worker schemes that operate at the expense of American organizations. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "9815f38cb416"
  },
  {
    "title": "Google shares workarounds for auth failures on ChromeOS devices",
    "url": "https://www.bleepingcomputer.com/news/google/google-shares-chromeos-workarounds-for-clever-classlink-auth-failures/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T18:30:07",
    "summary": "Google is working to resolve authentication failures preventing users from signing into their Clever and ClassLink accounts on some ChromeOS devices. [...]",
    "content": "Google is working to resolve authentication failures preventing users from signing into their Clever and ClassLink accounts on some ChromeOS devices. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "5b1e79f3e14f"
  },
  {
    "title": "Microsoft Word will save your files to the cloud by default",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-word-will-save-your-files-to-the-cloud-by-default/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T17:00:28",
    "summary": "Microsoft says that Word for Windows will soon enable autosave and automatically save all new documents to the cloud by default. [...]",
    "content": "Microsoft says that Word for Windows will soon enable autosave and automatically save all new documents to the cloud by default. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "7fe061ae42ff"
  },
  {
    "title": "Police seize VerifTools fake ID marketplace servers, domains",
    "url": "https://www.bleepingcomputer.com/news/security/police-seize-veriftools-fake-id-marketplace-servers-domains/",
    "source": "BleepingComputer",
    "category": "technical",
    "published_date": "2025-08-28T16:00:35",
    "summary": "The FBI and the Dutch Police have shut down the VerifTools marketplace for fraudulent identity documents after seizing servers in Amsterdam that hosted the online operation. [...]",
    "content": "The FBI and the Dutch Police have shut down the VerifTools marketplace for fraudulent identity documents after seizing servers in Amsterdam that hosted the online operation. [...]",
    "keywords": [],
    "priority_score": 0,
    "article_id": "ade6cc1026f9"
  },
  {
    "title": "Increasing Searches for ZIP Files, (Thu, Aug 28th)",
    "url": "https://isc.sans.edu/diary/rss/32242",
    "source": "SANS Internet Storm Center",
    "category": "research",
    "published_date": "2025-08-28T14:57:38",
    "summary": "I noticed recently that we have more and more requests for ZIP files in our web honeypot logs. Over the last year, we have had a substantial increase in these requests.&#xd;",
    "content": "I noticed recently that we have more and more requests for ZIP files in our web honeypot logs. Over the last year, we have had a substantial increase in these requests.",
    "keywords": [],
    "priority_score": 0,
    "article_id": "7e4050ed4d2e"
  },
  {
    "title": "Interesting Technique to Launch a Shellcode, (Wed, Aug 27th)",
    "url": "https://isc.sans.edu/diary/rss/32238",
    "source": "SANS Internet Storm Center",
    "category": "research",
    "published_date": "2025-08-27T05:55:21",
    "summary": "In most attack scenarios, attackers have to perform a crucial operation: to load a shellcode in memory and execute it. This is often performed in a three-step process:&#xd;",
    "content": "In most attack scenarios, attackers have to perform a crucial operation: to load a shellcode in memory and execute it. This is often performed in a three-step process:",
    "keywords": [],
    "priority_score": 0,
    "article_id": "facc4f7945a9"
  },
  {
    "title": "Getting a Better Handle on International Domain Names and Punycode, (Tue, Aug 26th)",
    "url": "https://isc.sans.edu/diary/rss/32234",
    "source": "SANS Internet Storm Center",
    "category": "research",
    "published_date": "2025-08-26T16:34:11",
    "summary": "International domain names (IDN) continue to be an interesting topic. For the most part, they are probably less of an issue than some people make them out to be, given that popular browsers like Google Chrome are pretty selective in displaying them. But on the other hand, they are still used legitimately or not, and keeping a handle on them is interesting.&#xd;",
    "content": "International domain names (IDN) continue to be an interesting topic. For the most part, they are probably less of an issue than some people make them out to be, given that popular browsers like Google Chrome are pretty selective in displaying them. But on the other hand, they are still used legitimately or not, and keeping a handle on them is interesting.",
    "keywords": [],
    "priority_score": 0,
    "article_id": "8dfc3655721e"
  },
  {
    "title": "Reading Location Position Value in Microsoft Word Documents, (Mon, Aug 25th)",
    "url": "https://isc.sans.edu/diary/rss/32224",
    "source": "SANS Internet Storm Center",
    "category": "research",
    "published_date": "2025-08-25T00:09:14",
    "summary": "While studying for the GX-FE &&#x23&#x3b;x26&#x3b;&#x23&#x3b;x5b&#x3b;1&&#x23&#x3b;x26&#x3b;&#x23&#x3b;x5d&#x3b;, I started exploring the \"Position\" value in the registry that helps to tell Microsoft Word where you \"left off\". It&&#x23&#x3b;x26&#x3b;&#x23&#x3b;39&#x3b;s a feature many people that use Word have seen on numerous occasions and is explored in FOR500: Windows Forensic Analysis &&#x23&#x3b;x26&#x3b;&#x23&#x3b;x5b&#x3b;2&&#x23&#x3b;x26&#x3b;&#x23&#x3b;x5d&#x3b;. &#xd;",
    "content": "While studying for the GX-FE [1], I started exploring the &quot;Position&quot; value in the registry that helps to tell Microsoft Word where you &quot;left off&quot;. It's a feature many people that use Word have seen on numerous occasions and is explored in FOR500: Windows Forensic Analysis [2].&nbsp;",
    "keywords": [],
    "priority_score": 0,
    "article_id": "4da3f08c95a9"
  },
  {
    "title": "The end of an era: Properly formated IP addresses in all of our data., (Sun, Aug 24th)",
    "url": "https://isc.sans.edu/diary/rss/32228",
    "source": "SANS Internet Storm Center",
    "category": "research",
    "published_date": "2025-08-24T18:10:05",
    "summary": "The Internet Storm Center and DShield websites are about 25 years old. Back in the day, I made some questionable decisions that I have never quite cleaned up later. One of these decisions was to use a \"15 character 0-padded\" format for IP addresses. This format padded each byte in the IP address with leading 0&&#x23&#x3b;x26&#x3b;&#x23&#x3b;39&#x3b;s, ensuring that they were all 15 characters long (including the &&#x23&#x3b;x26&#x3b;&#x23&#x3b;39&#x3b;.&&#x23&#x3b;x26&#x3b;&#x23&#x3b;39&#x3b;). &#xd;",
    "content": "The Internet Storm Center and DShield websites are about 25 years old. Back in the day, I made some questionable decisions that I have never quite cleaned up later. One of these decisions was to use a &quot;15 character 0-padded&quot; format for IP addresses. This format padded each byte in the IP address with leading 0's, ensuring that they were all 15 characters long (including the '.').&nbsp;",
    "keywords": [],
    "priority_score": 0,
    "article_id": "48a6e9f6b1d9"
  }
]